DataProcessors/бит_ЗакрытиеПлатежногоПериода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_ЗакрытиеПлатежногоПериода</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыполнитьНачисления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/бит_ЗакрытиеПлатежногоПериода/Forms/ФормаУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура выполняет загрузку настроек отбора из настроек по умолчанию.
//
&НаСервере
Процедура ЗагрузитьНастройкиОтбораПоУмолчанию()
	
	СхемаКомпоновкиДанных = Обработки.бит_ЗакрытиеМесяцаЖКХ.ПолучитьМакет("ОсновныеНачисления");
	КомпоновщикНастроек.Инициализировать(
	Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор))
	);
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
КонецПроцедуры // ЗагрузитьНастройкиОтбораПоУмолчанию()

#КонецОбласти

#Область ПроцедурыИФункцииУправленияВнешнимВидомФорм

// Процедура осуществляет управление доступностью/видимостью элементов формы.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УправлениеЭлементамиФормы()
	
	Элементы.ВидСравненияЗдание.Доступность  = ИспользоватьОтборЗдание;
	Элементы.ВидСравненияУчасток.Доступность = ИспользоватьОтборУчасток;
	Элементы.ВидСравненияРайон.Доступность   = ИспользоватьОтборРайон;
	Элементы.ВидСравненияУлица.Доступность   = ИспользоватьОтборУлица;
	
	Элементы.Здание.Доступность  = ИспользоватьОтборЗдание;
	Элементы.Участок.Доступность = ИспользоватьОтборУчасток;
	Элементы.Район.Доступность   = ИспользоватьОтборРайон;
	Элементы.Улица.Доступность   = ИспользоватьОтборУлица;
	
	Элементы.Выполнить.Доступность   = Объект.ВыполнитьНачисления;
	
КонецПроцедуры // УправлениеЭлементамиФормы()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагрузитьНастройкиОтбораПоУмолчанию();
	
	Элементы.ВидСравненияЗдание.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.Равно);
	Элементы.ВидСравненияЗдание.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеРавно);
	Элементы.ВидСравненияЗдание.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.ВСписке);
	Элементы.ВидСравненияЗдание.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеВСписке);
	
	Элементы.ВидСравненияУчасток.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.Равно);
	Элементы.ВидСравненияУчасток.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеРавно);
	Элементы.ВидСравненияУчасток.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.ВСписке);
	Элементы.ВидСравненияУчасток.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеВСписке);
	
	Элементы.ВидСравненияРайон.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.Равно);
	Элементы.ВидСравненияРайон.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеРавно);
	Элементы.ВидСравненияРайон.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.ВСписке);
	Элементы.ВидСравненияРайон.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеВСписке);
	
	Элементы.ВидСравненияУлица.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.Равно);
	Элементы.ВидСравненияУлица.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеРавно);
	Элементы.ВидСравненияУлица.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.ВСписке);
	Элементы.ВидСравненияУлица.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеВСписке);
	
	ВидСравненияРайон   = ВидСравненияКомпоновкиДанных.Равно;
	ВидСравненияУчасток = ВидСравненияКомпоновкиДанных.Равно;
	ВидСравненияЗдание  = ВидСравненияКомпоновкиДанных.Равно;
	ВидСравненияУлица   = ВидСравненияКомпоновкиДанных.Равно;
	
	Объект.Организация = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация",бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
	// БИТ_ЖКХ 17.04.2014
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		
		ОбработкаОбъект = ДанныеФормыВЗначение(Объект,Тип("ОбработкаОбъект.бит_ЗакрытиеПлатежногоПериода"));	
		
		бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ОбработкаОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
		
		Объект.Организация = ОбработкаОбъект.Организация;
		
	КонецЕсли;
	// БИТ_ЖКХ 17.04.2014
	
	Объект.ВыполнитьНачисления            = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеЭлементамиФормы();
	
	Объект.ДатаЗакрытия = КонецДня(бит_ОбщегоНазначения.ПолучитьРабочуюДату());
	
	Если Объект.ДатаЗакрытия < бит_ОбщегоНазначения.ПолучитьДатуЗакрытия(Объект.ДатаЗакрытия, Объект.Организация) Тогда
		
		Элементы.Выполнить.Доступность = Ложь;
		
		Текст = "Текущая ""Дата закрытия: "+ Формат(Объект.ДатаЗакрытия,"ДФ=dd.MM.yyyy") +""" не может быть меньше последнего дня оплаты платежей. Дата последнего дня оплаты на текущий месяц: "+ Формат(бит_ОбщегоНазначения.ПолучитьДатуЗакрытия(Объект.ДатаЗакрытия, Объект.Организация),"ДФ=dd.MM.yyyy") +".";
		бит_ОбщегоНазначения.СообщитьОбОшибке(Текст,,,СтатусСообщения.ОченьВажное);
		
	Иначе
		Элементы.Выполнить.Доступность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если Объект.ДатаЗакрытия < бит_ОбщегоНазначения.ПолучитьДатуЗакрытия(Объект.ДатаЗакрытия, Объект.Организация) Тогда
		
		Элементы.Выполнить.Доступность = Ложь;
		
		Текст = "Текущая ""Дата закрытия: "+ Формат(Объект.ДатаЗакрытия,"ДФ=dd.MM.yyyy") +""" не может быть меньше последнего дня оплаты платежей. Дата последнего дня оплаты на текущий месяц: "+ Формат(бит_ОбщегоНазначения.ПолучитьДатуЗакрытия(Объект.ДатаЗакрытия, Объект.Организация),"ДФ=dd.MM.yyyy") +".";
		бит_ОбщегоНазначения.СообщитьОбОшибке(Текст,,,СтатусСообщения.ОченьВажное);
		
	Иначе
		Элементы.Выполнить.Доступность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗакрытияПриИзменении(Элемент)
	
	Если Объект.ДатаЗакрытия < бит_ОбщегоНазначения.ПолучитьДатуЗакрытия(Объект.ДатаЗакрытия, Объект.Организация) Тогда
		
		Элементы.Выполнить.Доступность = Ложь;
		
		Текст = "Текущая ""Дата закрытия: "+ Формат(Объект.ДатаЗакрытия,"ДФ=dd.MM.yyyy") +""" не может быть меньше последнего дня оплаты платежей. Дата последнего дня оплаты на текущий месяц: "+ Формат(бит_ОбщегоНазначения.ПолучитьДатуЗакрытия(Объект.ДатаЗакрытия, Объект.Организация),"ДФ=dd.MM.yyyy") +".";
		бит_ОбщегоНазначения.СообщитьОбОшибке(Текст,,,СтатусСообщения.ОченьВажное);
		
	Иначе
		Элементы.Выполнить.Доступность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборРайонПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование  = ИспользоватьОтборРайон;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборУчастокПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Использование  = ИспользоватьОтборУчасток;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборУлицаПриИзменении(Элемент)
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[2].Использование  = ИспользоватьОтборУлица;
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборЗданиеПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	КомпоновщикНастроек.Настройки.Отбор.Элементы[3].Использование  = ИспользоватьОтборЗдание;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСравненияРайонПриИзменении(Элемент)
	
	Если ВидСравненияРайон = Неопределено Тогда
		
		ВидСравненияРайон = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
	Если (ВидСравненияРайон = ВидСравненияКомпоновкиДанных.Равно ИЛИ ВидСравненияРайон = ВидСравненияКомпоновкиДанных.НеРавно)
		И ТипЗнч(Район) = Тип("СписокЗначений") Тогда
		
		Район = Неопределено;
		ПоместитьЗначениеВОтборКомпановщика(Район, 0);
		
	КонецЕсли; 
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[0].ВидСравнения   = ВидСравненияРайон;
	
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	
	ПоместитьЗначениеВОтборКомпановщика(Район, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура РайонНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МножественныйВыбор = (ВидСравненияРайон = ВидСравненияКомпоновкиДанных.ВСписке ИЛИ ВидСравненияРайон = ВидСравненияКомпоновкиДанных.НеВСписке);
	
	ОткрытьФорму("Справочник.бит_АдминистративныеОкруга.Форма.ФормаВыбораУправляемая",Новый Структура("МножественныйВыбор", МножественныйВыбор),Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РайонОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Список = Новый СписокЗначений;
		Список.ЗагрузитьЗначения(ВыбранноеЗначение);
		
		ВыбранноеЗначение = Список;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСравненияУлицаПриИзменении(Элемент)
	
	Если ВидСравненияУлица = Неопределено Тогда
		
		ВидСравненияУлица = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
	Если (ВидСравненияУлица = ВидСравненияКомпоновкиДанных.Равно ИЛИ ВидСравненияУлица = ВидСравненияКомпоновкиДанных.НеРавно)
		И ТипЗнч(Улица) = Тип("СписокЗначений") Тогда
		
		Улица = Неопределено;
		ПоместитьЗначениеВОтборКомпановщика(Улица, 2);
		
	КонецЕсли;
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[2].ВидСравнения   = ВидСравненияУлица;
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	
	ПоместитьЗначениеВОтборКомпановщика(Улица, 2);
	
	// БИТ_ЖКХ_20082015_начало_изменения
	Здание = Неопределено;
	// БИТ_ЖКХ_20082015_окончание_изменения
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МножественныйВыбор = (ВидСравненияУлица = ВидСравненияКомпоновкиДанных.ВСписке ИЛИ ВидСравненияУлица = ВидСравненияКомпоновкиДанных.НеВСписке);
	
	ОткрытьФорму("Справочник.бит_СписокУлиц.Форма.ФормаВыбораУправляемая",Новый Структура("МножественныйВыбор", МножественныйВыбор),Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Список = Новый СписокЗначений;
		Список.ЗагрузитьЗначения(ВыбранноеЗначение);
		
		ВыбранноеЗначение = Список;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСравненияЗданиеПриИзменении(Элемент)
	
	Если ВидСравненияЗдание = Неопределено Тогда
		
		ВидСравненияЗдание = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
	Если (ВидСравненияЗдание = ВидСравненияКомпоновкиДанных.Равно ИЛИ ВидСравненияЗдание = ВидСравненияКомпоновкиДанных.НеРавно)
		И ТипЗнч(Здание) = Тип("СписокЗначений") Тогда
		
		Здание = Неопределено;
		ПоместитьЗначениеВОтборКомпановщика(Здание, 3);
		
	КонецЕсли; 
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[3].ВидСравнения   = ВидСравненияЗдание;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеПриИзменении(Элемент)
	
	ПоместитьЗначениеВОтборКомпановщика(Здание, 3);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	
	Если ИспользоватьОтборРайон И ЗначениеЗаполнено(Район) Тогда
		Отбор.Вставить("Район", Район);
	КонецЕсли;
	
	Если ИспользоватьОтборУчасток И ЗначениеЗаполнено(Участок) Тогда
		Отбор.Вставить("Участок", Участок);
	КонецЕсли;
	
	Если ИспользоватьОтборУлица И ЗначениеЗаполнено(Улица) Тогда
		Отбор.Вставить("Улица", Улица);
	КонецЕсли;
	
	МножественныйВыбор = (ВидСравненияЗдание = ВидСравненияКомпоновкиДанных.ВСписке ИЛИ ВидСравненияЗдание = ВидСравненияКомпоновкиДанных.НеВСписке);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая",Новый Структура("Отбор, МножественныйВыбор", Отбор, МножественныйВыбор),Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Список = Новый СписокЗначений;
		Список.ЗагрузитьЗначения(ВыбранноеЗначение);
		
		ВыбранноеЗначение = Список;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСравненияУчастокПриИзменении(Элемент)
	
	Если ВидСравненияУчасток = Неопределено Тогда
		
		ВидСравненияУчасток = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
	Если (ВидСравненияУчасток = ВидСравненияКомпоновкиДанных.Равно ИЛИ ВидСравненияУчасток = ВидСравненияКомпоновкиДанных.НеРавно)
		И ТипЗнч(Участок) = Тип("СписокЗначений") Тогда
		
		Участок = Неопределено;
		ПоместитьЗначениеВОтборКомпановщика(Участок, 1);
		
	КонецЕсли;
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[1].ВидСравнения   = ВидСравненияУчасток;
	
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	
	ПоместитьЗначениеВОтборКомпановщика(Участок, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура УчастокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МножественныйВыбор = (ВидСравненияУчасток = ВидСравненияКомпоновкиДанных.ВСписке ИЛИ ВидСравненияУчасток = ВидСравненияКомпоновкиДанных.НеВСписке);
	
	ОткрытьФорму("Справочник.бит_ТехническиеУчастки.Форма.ФормаВыбораУправляемая",Новый Структура("МножественныйВыбор", МножественныйВыбор),Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УчастокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Список = Новый СписокЗначений;
		Список.ЗагрузитьЗначения(ВыбранноеЗначение);
		
		ВыбранноеЗначение = Список;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ВыполнитьНачисления(Команда)
	
	Форма = ПолучитьФорму("Обработка.бит_ЗакрытиеПлатежногоПериода.Форма.ФормаРаботыСДокументами",,ЭтаФорма, ЭтаФорма);
	
	Если Форма.Открыта() Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перед закрытием месяца закройте ""Форму работы с документами""!");
		
		Возврат;
		
	КонецЕсли; 

	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Выполняется закрытие платежного периода.");
	
	ВыполнитьНачисленияНаСервере();
	
	Элементы.Индикатор.Заголовок = "Начисления выполнены";

	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Закрытие платежного периода выполнено.");
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьНачисленияНаСервере()
	
	ОбработкаОбъект = ДанныеФормыВЗначение(Объект, Тип("ОбработкаОбъект.бит_ЗакрытиеПлатежногоПериода"));
	
	ОбработкаОбъект.ВыполнитьНачисление(Индикатор,Улица,Здание);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаРаботыСдокументами(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация" , Объект.Организация);
	ПараметрыФормы.Вставить("ДатаЗакрытия", Объект.ДатаЗакрытия);
	
	Форма = ПолучитьФорму("Обработка.бит_ЗакрытиеПлатежногоПериода.Форма.ФормаРаботыСДокументами", ПараметрыФормы, ЭтаФорма, ЭтаФорма);
	
	Если Форма.Открыта() Тогда
		Форма.Активизировать();
	Иначе
		Форма.Открыть();
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаКлиенте
Процедура ПоместитьЗначениеВОтборКомпановщика(Значение, Индекс)
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[Индекс].ПравоеЗначение = Значение;
	
КонецПроцедуры

#КонецОбласти
